# ============================================================================
# Options
# ============================================================================
cask_args quarantine: false

# ============================================================================
# Taps
# ============================================================================
tap "nikitabobko/tap"

# ============================================================================
# Terminal & Shell
# ============================================================================
brew "zsh"                  # Modern shell
brew "bash"                 # Latest bash version
brew "tmux"                 # Terminal multiplexer
brew "neovim"               # Modern vim
brew "starship"             # Cross-shell prompt
brew "zoxide"               # Smarter cd command
brew "chezmoi"              # Dotfiles manager
brew "thefuck"              # Correct previous command
brew "atuin"                # Shell history search

# ============================================================================
# Modern CLI Tools (Rust-based replacements)
# ============================================================================
brew "bat"                  # cat with syntax highlighting
brew "eza"                  # ls replacement
brew "fd"                   # find replacement
brew "ripgrep"              # grep replacement
brew "fzf"                  # Fuzzy finder
brew "tree"                 # Directory tree view
brew "btop"                 # Resource monitor
brew "dust"                 # du replacement
brew "duf"                  # df replacement
brew "procs"                # ps replacement
brew "jq"                   # JSON processor
brew "yq"                   # YAML processor
brew "tlrc"                 # tldr pages client
brew "coreutils"            # GNU core utilities
brew "sd"                   # sed replacement
brew "hyperfine"            # Benchmarking tool
brew "tokei"                # Code statistics
brew "xh"                   # HTTPie replacement

# ============================================================================
# System Utilities
# ============================================================================
brew "fastfetch"            # System info display
brew "wget"                 # File downloader
brew "curl"                 # URL transfer tool
brew "openssh"              # SSH client/server
brew "rsync"                # Fast file sync
brew "nmap"                 # Network scanner
brew "mtr"                  # Network diagnostic
brew "trash"                # Safe rm replacement

# ============================================================================
# Git & Version Control
# ============================================================================
brew "git"                  # Version control
brew "git-delta"            # Better git diff
brew "lazygit"              # Git TUI
brew "gh"                   # GitHub CLI
brew "git-lfs"              # Large file storage
brew "gitleaks"             # Git secrets scanner

# ============================================================================
# Security & Privacy
# ============================================================================
brew "gnupg"                # GPG encryption
brew "git-crypt"            # Git file encryption
brew "age"                  # Modern encryption
brew "sops"                 # Secrets management
brew "lynis"                # Security auditing
brew "trivy"                # Container scanner

# ============================================================================
# Language Version Managers
# ============================================================================
brew "mise"                 # Polyglot runtime manager (replaces rbenv, nodenv, pyenv, goenv)
brew "rustup"               # Rust toolchain

# ============================================================================
# Development Utilities
# ============================================================================
brew "direnv"               # Per-directory env vars
brew "watchman"             # File watcher
brew "shellcheck"           # Shell script linter
brew "shfmt"                # Shell script formatter
brew "pre-commit"           # Git hooks manager
brew "act"                  # Run GitHub Actions locally

# ============================================================================
# Databases & Data
# ============================================================================
brew "sqlite"               # Lightweight database
brew "redis"                # In-memory data store
brew "postgresql@16"        # PostgreSQL database

# ============================================================================
# Productivity Apps
# ============================================================================
cask "raycast"              # Spotlight replacement
cask "notion"               # Notes & docs
cask "nikitabobko/tap/aerospace"    # Tiling window manager
cask "hiddenbar"            # Menu bar manager
cask "slack"                # Team chat
cask "obsidian"             # Markdown notes
cask "1password"            # Password manager

# ============================================================================
# Terminal Emulators
# ============================================================================
cask "iterm2"               # Terminal emulator
cask "warp"                 # Modern terminal

# ============================================================================
# Development Apps
# ============================================================================
cask "visual-studio-code"   # Code editor
cask "docker"               # Containers
brew "lazydocker"           # Docker TUI
cask "bruno"                # API client
cask "zen-browser"          # Privacy browser
cask "tableplus"            # Database GUI

# ============================================================================
# Utility Apps
# ============================================================================
cask "alt-tab"              # Windows-style alt-tab
cask "gas-mask"             # Hosts file manager
cask "scroll-reverser"      # Mouse scroll direction
cask "utm"                  # Virtual machines
cask "the-unarchiver"       # Archive extraction
cask "appcleaner"           # App uninstaller
cask "stats"                # System monitor menubar
cask "keka"                 # File archiver

# ============================================================================
# Media & Creative
# ============================================================================
brew "ffmpeg"               # Video/audio processing
brew "imagemagick"          # Image manipulation
brew "yt-dlp"               # Video downloader
cask "vlc"                  # Media player
cask "handbrake"            # Video transcoder
cask "figma"                # Design tool

# ============================================================================
# Communication
# ============================================================================
cask "discord"              # Gaming chat
cask "zoom"                 # Video conferencing

# ============================================================================
# Fonts
# ============================================================================
cask "font-fira-code-nerd-font"       # Fira Code + icons
cask "font-jetbrains-mono-nerd-font"  # JetBrains Mono + icons
cask "font-hack-nerd-font"            # Hack + icons
cask "font-meslo-lg-nerd-font"        # Meslo + icons
